tests/test1.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://www.examples.com/wsdl/HelloService.wsdl">
    <soap:Body>
        <tns:calculateC>
            <weight>65.7</weight>
            <height>1.63</height>
        </tns:calculateC>
    </soap:Body>
</soap:Envelope>